app/controllers/admins_controller.rb

INSERT INTO "admins" ("username", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "tiks"], ["email", "ggis@gmail.com"], ["created_at", "2020-05-09 22:02:12.643710"], ["updated_at", "2020-05-09 22:02:12.643710"]]
---
  def create
    @admin = Admin.new(admins_params)
    if @admin.save

SELECT "admins".* FROM "admins"
---
  def allcontent
    @admin = Admin.all

SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show
    @admin = Admin.find(params[:id])