app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def allcontent
    @posts = Post.all

SELECT "posts".* FROM "posts"
---
  def admin
    @posts = Post.all

SELECT "posts".* FROM "posts"
---
  def recent
    @posts = Post.all

SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["id", 5], ["content", "posted by id 5, sundi"], ["created_at", "2020-05-10 00:45:54.014311"], ["updated_at", "2020-05-10 00:45:54.014311"]]
---
  def create
    @post = Post.new(post_params)
    @admin = Admin.find(session[:admin_id])

    respond_to do |format|
      if @post.save