app/controllers/sessions_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def create
    @admin = Admin.find_by_id(params[:session][:id])